tutorials/DLbuoyantPimpleFoam/array_of_chips/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    bot
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    obstacle
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
}


// ************************************************************************* //
