tutorials/DLbuoyantPimpleFoam/array_of_chips/system/extrudeMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

constructFrom mesh;
sourceCase ".";
sourcePatches    (outlet);            // Name of the patch to extrude from
extrudeType      patchNormal;
exposedPatchName outlet;
direction (1 0 0);

flipNormals false;

extrudeModel linearDirection;

expansionRatio 1.015;
firstLayerThickness 0.001;
nLayers 90;


linearDirectionCoeffs
{
    direction (1 0 0);
    thickness 0.22;
}

mergeFaces false;
mergeTol 0;
