tutorials/DLbuoyantPimpleFoam/array_of_chips/system/fvOptions
limitH
{
    type        limitFields;
    fields
    (
        h
        {
            min     2.8e5;
            max     3.4e5;
        }
    );
}